Revit 2027 API
RebarFreeFormAccessor.GetShapeIdAtIndex Method
 Gets the Rebar Shape id for the bar with index barPositionIndex.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId GetShapeIdAtIndex(
	int barPositionIndex
)
Public Function GetShapeIdAtIndex (
	barPositionIndex As Integer
) As ElementId
public:
ElementId^ GetShapeIdAtIndex(
	int barPositionIndex
)
member GetShapeIdAtIndex :
        barPositionIndex : int -> ElementId
Parameters
barPositionIndex Int32
 An index between 0 and (NumberOfBarPositions-1).
Return Value
ElementId
 Gets the ElementId of the Rebar Shape for the bar with index barPositionIndex.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ]. -or- The bar at barPositionIndex index is excluded.
Remarks
 If this function is called for a bar that isn't included, this function will throw exception.
See Also
Reference
RebarFreeFormAccessor Class
Autodesk.Revit.DB.Structure Namespace